Revit 2027 API
ParameterTypeId.SteelElemShearstudDiameter Property
 "Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemShearstudDiameter { get; }
Public Shared ReadOnly Property SteelElemShearstudDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemShearstudDiameter {
	ForgeTypeId^ get ();
}
static member SteelElemShearstudDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace